; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v5 - type_2 ?v7 - type_1)
 	      (pred_4 ?v8 - object ?v7 - type_1)
	      (pred_3 ?v5 - type_2 ?v4 - type_3)
	      (pred_1 ?v5 - type_2 ?v8 - object ?v4 - type_3))

   (:action op_1
       :parameters  (?v5 - type_2 ?v1 ?v2 - type_1)
       :precondition (and  (pred_2 ?v5 ?v1))
       :effect (and  (pred_2 ?v5 ?v2)
		     (not (pred_2 ?v5 ?v1))))

   (:action op_3
       :parameters (?v5 - type_2 ?v6 - object ?v3 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v3) (pred_2 ?v5 ?v3) (pred_3 ?v5 ?v4))
       :effect (and (pred_1 ?v5 ?v6 ?v4)
		    (not (pred_4 ?v6 ?v3)) 
		    (not (pred_3 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_2 ?v6 - object ?v3 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v6 ?v4) (pred_2 ?v5 ?v3))
       :effect (and (pred_4 ?v6 ?v3)
		    (pred_3 ?v5 ?v4)
		    (not (pred_1 ?v5 ?v6 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_09 - type_2
obj_12 obj_01 obj_07 obj_10 - type_3
obj_03 obj_02 obj_04 obj_13 - type_1
obj_08 obj_05 obj_06 - object)
(:init
(pred_2 obj_11 obj_04)
(pred_3 obj_11 obj_12)
(pred_3 obj_11 obj_01)
(pred_2 obj_09 obj_13)
(pred_3 obj_09 obj_07)
(pred_3 obj_09 obj_10)
(pred_4 obj_08 obj_02)
(pred_4 obj_05 obj_04)
(pred_4 obj_06 obj_13)
)
(:goal
(and
(pred_4 obj_08 obj_02)
(pred_4 obj_05 obj_13)
(pred_4 obj_06 obj_04)
)
)

(:constraints
  (always (not (pred_2 obj_11 obj_13)))
)
)

; plan
1. (op_1 obj_11 obj_04 obj_03)
   deleted: (pred_2 obj_11 obj_04)
   added: (pred_2 obj_11 obj_03)
   goals met: 1 of 3
2. (op_3 obj_09 obj_06 obj_13 obj_10)
   deleted: (pred_4 obj_06 obj_13) (pred_3 obj_09 obj_10)
   added: (pred_1 obj_09 obj_06 obj_10)
   goals met: 1 of 3
3. (op_1 obj_09 obj_13 obj_04)
   deleted: (pred_2 obj_09 obj_13)
   added: (pred_2 obj_09 obj_04)
   goals met: 1 of 3
4. (op_2 obj_09 obj_06 obj_04 obj_10)
   deleted: (pred_1 obj_09 obj_06 obj_10)
   added: (pred_4 obj_06 obj_04) (pred_3 obj_09 obj_10)
   goals met: 2 of 3
5. (op_3 obj_09 obj_05 obj_04 obj_07)
   deleted: (pred_4 obj_05 obj_04) (pred_3 obj_09 obj_07)
   added: (pred_1 obj_09 obj_05 obj_07)
   goals met: 2 of 3
6. (op_1 obj_09 obj_04 obj_13)
   deleted: (pred_2 obj_09 obj_04)
   added: (pred_2 obj_09 obj_13)
   goals met: 2 of 3
7. (op_2 obj_09 obj_05 obj_13 obj_07)
   deleted: (pred_1 obj_09 obj_05 obj_07)
   added: (pred_4 obj_05 obj_13) (pred_3 obj_09 obj_07)
   goals met: 3 of 3
